#ifndef _UNISOUND_BOX_
#define _UNISOUND_BOX_
#include "app_config.h"

#if TCFG_UNISOUND_ENABLE


#define TCFG_KWS_TEST_ENABLE 	(0)//使能打印关键词唤醒次数
#define KWS_NUM				 	(17)//关键词个数

enum {
    PREV_MUSIC = 0,
    NEXT_MUSIC,
    PP_MUSIC,
    PLAY_MUSIC,
    UP_VOL,
    DOWN_VOL,
    SIRI_OPEN,
    OPEN_SCR,
    CLOSE_SCR,
    CALL_FATHER,
    CALL_MOTHER,
    CALL,
    OPEN_VIDEO,
    CLOSE_VIDEO,
    TAKE_PIC,
    PLAYBACK,
    OPEN_MSG,
};

int uniAsrInit(void);
int uniAsrProcess(void *data, int size);
int uniAsrUninit(void);

/*----------------------------------------------------------------------------*/
/**@brief    unisound模块初始化
   @param	 事件类型
   @return   0:成功， 1:失败
   @note
*/
/*----------------------------------------------------------------------------*/
int unisound_init(void);

/*----------------------------------------------------------------------------*/
/**@brief    关闭unisound模块
   @param	 事件类型
   @return
   @note	 关闭mic，关闭语音识别，释放相关资源
*/
/*----------------------------------------------------------------------------*/
void unisound_uninit(void);

/*----------------------------------------------------------------------------*/
/**@brief    获取语音识别初始化状态
   @param
   @return	 0:未初始化， 1:已初始化
   @note
*/
/*----------------------------------------------------------------------------*/
u8 get_unisound_online(void);

/*----------------------------------------------------------------------------*/
/**@brief    多麦录音初始化
   @param
   @return	 0:未初始化， 1:已初始化
   @note
*/
/*----------------------------------------------------------------------------*/
int unisound_multiple_mic_rec_init();

/*----------------------------------------------------------------------------*/
/**@brief    关闭多麦录音
   @param
   @return
   @note
*/
/*----------------------------------------------------------------------------*/
int unisound_multiple_mic_rec_uninit();

/*----------------------------------------------------------------------------*/
/**@brief    获取多麦录音初始化成功标志
   @param
   @return
   @note
*/
/*----------------------------------------------------------------------------*/
u8 unisound_get_rec_file_init_ok(void);

/*----------------------------------------------------------------------------*/
/**@brief    ssp降噪通道录音初始化
   @param	 0:成功， 1:失败
   @return
   @note
*/
/*----------------------------------------------------------------------------*/
u8 ssp_data_export_init(void);

/*----------------------------------------------------------------------------*/
/**@brief    释放ssp降噪通道录音申请资源
   @param
   @return
   @note
*/
/*----------------------------------------------------------------------------*/
void ssp_data_export_uninit(void);

/*----------------------------------------------------------------------------*/
/**@brief    设置通话状态
   @param
   @return
   @note
*/
/*----------------------------------------------------------------------------*/
u8 unisound_set_esco_online(u8 online);

/*----------------------------------------------------------------------------*/
/**@brief    设置SIRI状态
   @param
   @return
   @note
*/
/*----------------------------------------------------------------------------*/
u8 unisound_set_siri_online(u8 online);

/*----------------------------------------------------------------------------*/
/**@brief    设置unisound状态
   @param
   @return
   @note
*/
/*----------------------------------------------------------------------------*/
u8 unisound_set_online(u8 online);
#endif

/*----------------------------------------------------------------------------*/
/**@brief    rgb led status set
   @param	 1: on 0: off
   @return
   @note
*/
/*----------------------------------------------------------------------------*/
void rgb_led_status_set(u8 red, u8 green, u8 blue);

/*----------------------------------------------------------------------------*/
/**@brief    unisound ui
   @param	 1: tone 0: no tone
   @return
   @note
*/
/*----------------------------------------------------------------------------*/
void unisound_ui_show(u8 tone_flag);
#endif

